In [6]:
import numpy as np
import pandas as pd

In [7]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                  'key2': ['one','two','one','two','one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})

In [8]:
df

  key1 key2     data1     data2
0    a  one  1.861143 -0.228867
1    a  two -0.925666 -0.872354
2    b  one  0.757849 -1.088381
3    b  two  1.238252  0.593086
4    a  one -0.986684  0.961758

In [13]:
meandf1 = df['data1'].groupby(df['key1'])
meandf1

In [17]:
meandf1.mean()

key1
a   -0.017069
b    0.998051
Name: data1, dtype: float64

In [21]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.437229
      two    -0.925666
b     one     0.757849
      two     1.238252
Name: data1, dtype: float64

In [22]:
means.unstack()

key2       one       two
key1
a     0.437229 -0.925666
b     0.757849  1.238252

In [29]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])

In [30]:
years = np.array([2005,2005,2006,2005,2006])

In [31]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.925666
            2006    0.757849
Ohio        2005    1.549697
            2006   -0.986684
Name: data1, dtype: float64

In [33]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.017069 -0.046488
b     0.998051 -0.247648

In [36]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.437229  0.366445
     two  -0.925666 -0.872354
b    one   0.757849 -1.088381
     two   1.238252  0.593086

In [9]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [37]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [39]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.861143 -0.228867
1    a  two -0.925666 -0.872354
4    a  one -0.986684  0.961758
b
  key1 key2     data1     data2
2    b  one  0.757849 -1.088381
3    b  two  1.238252  0.593086

In [42]:
for (k1,k2), group in df.groupby(['key1','key2']):
    print(k1,k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one  1.861143 -0.228867
4    a  one -0.986684  0.961758
a two
  key1 key2     data1     data2
1    a  two -0.925666 -0.872354
b one
  key1 key2     data1     data2
2    b  one  0.757849 -1.088381
b two
  key1 key2     data1     data2
3    b  two  1.238252  0.593086

In [43]:
for (k1,k2), group in df.groupby(['key1','key2']):
    print(name)
    print(group)

b
  key1 key2     data1     data2
0    a  one  1.861143 -0.228867
4    a  one -0.986684  0.961758
b
  key1 key2     data1     data2
1    a  two -0.925666 -0.872354
b
  key1 key2     data1     data2
2    b  one  0.757849 -1.088381
b
  key1 key2     data1     data2
3    b  two  1.238252  0.593086

In [47]:
pieces = dict(list(df.groupby('key1')))
pieces

{'a':   key1 key2     data1     data2
 0    a  one  1.861143 -0.228867
 1    a  two -0.925666 -0.872354
 4    a  one -0.986684  0.961758, 'b':   key1 key2     data1     data2
 2    b  one  0.757849 -1.088381
 3    b  two  1.238252  0.593086}

In [50]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.757849 -1.088381
3    b  two  1.238252  0.593086

In [51]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [52]:
grouped = df.groupby(df.dtypes, axis=1)

In [54]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  1.861143 -0.228867
1 -0.925666 -0.872354
2  0.757849 -1.088381
3  1.238252  0.593086
4 -0.986684  0.961758
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [176]:
import pandas as pd
import urllib.parse

limit = urllib.parse.quote("date_extract_y(grade_date) = 2018")
food_scores = pd.read_csv("https://data.cityofnewyork.us/resource/43nn-pn8j.csv?$where=" + limit)

food_scores.head()

,camis,dba,boro,building,street,zipcode,phone,cuisine_description,inspection_date,action,...,record_date,inspection_type,latitude,longitude,community_board,council_district,census_tract,bin,bbl,nta
0,41658103,CHOP SHOP,Manhattan,254,10 AVENUE,10001.0,2128200333,Asian,2018-07-10T00:00:00.000,Violations were cited in the following area(s).,...,2019-12-10T06:01:14.000,Cycle Inspection / Re-inspection,40.748764,-74.003375,104.0,3.0,9300.0,1012823.0,1007220076,MN13
1,41686442,SUBWAY,Queens,3942,21 STREET,11101.0,7183615700,Sandwiches,2018-09-27T00:00:00.000,Violations were cited in the following area(s).,...,2019-12-10T06:01:14.000,Cycle Inspection / Re-inspection,40.755921,-73.940588,401.0,26.0,8500.0,4005319.0,4004710690,QN68
2,41700508,ORANGE HUT,Queens,5317,BROADWAY,11377.0,7182745609,Delicatessen,2018-01-26T00:00:00.000,Violations were cited in the following area(s).,...,2019-12-10T06:01:14.000,Cycle Inspection / Re-inspection,40.753549,-73.907459,401.0,26.0,29500.0,4439243.0,4011550036,QN63
3,50073673,TANOSHI SUSHI SAKE BAR,Manhattan,1372,YORK AVE,10021.0,9172658254,Japanese,2018-05-02T00:00:00.000,Establishment Closed by DOHMH. Violations wer...,...,2019-12-10T06:01:14.000,Pre-permit (Operational) / Re-inspection,40.767669,-73.953133,108.0,5.0,12400.0,1046275.0,1014850002,MN31
4,50033152,BAR BOLINAS,Brooklyn,455,MYRTLE AVE,11205.0,7189359333,Californian,2018-01-26T00:00:00.000,Violations were cited in the following area(s).,...,2019-12-10T06:01:14.000,Cycle Inspection / Re-inspection,40.693299,-73.967253,302.0,35.0,19100.0,3054406.0,3018890092,BK69

In [183]:
food_scores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 26 columns):
camis                    1000 non-null int64
dba                      1000 non-null object
boro                     1000 non-null object
building                 1000 non-null object
street                   1000 non-null object
zipcode                  975 non-null float64
phone                    1000 non-null int64
cuisine_description      1000 non-null object
inspection_date          1000 non-null object
action                   1000 non-null object
violation_code           995 non-null object
violation_description    993 non-null object
critical_flag            993 non-null object
score                    1000 non-null int64
grade                    1000 non-null object
grade_date               1000 non-null object
record_date              1000 non-null object
inspection_type          1000 non-null object
latitude                 1000 non-null float64
longitude                1000 non-null float64
community_board          975 non-null float64
council_district         975 non-null float64
census_tract             975 non-null float64
bin                      972 non-null float64
bbl                      1000 non-null int64
nta                      975 non-null object
dtypes: float64(7), int64(4), object(15)
memory usage: 203.2+ KB

In [194]:
food_scores['violation_code'].count

<bound method Series.count of 0      04N
1      10F
2      06D
3      04H
4      06C
5      10F
6      04H
7      09C
8      10F
9      04L
10     10F
11     08A
12     22F
13     04J
14     04N
15     10B
16     04H
17     10I
18     02B
19     10B
20     06F
21     08A
22     08A
23     09C
24     02G
25     06A
26     02B
27     06C
28     10F
29     06C
      ...
970    10F
971    10H
972    06D
973    08A
974    06C
975    10F
976    10B
977    10F
978    09C
979    06F
980    04L
981    10F
982    06D
983    06C
984    09C
985    10B
986    08A
987    10F
988    06D
989    06E
990    02G
991    08A
992    10B
993    10B
994    08A
995    09C
996    04L
997    02B
998    10F
999    08A
Name: violation_code, Length: 1000, dtype: object>

In [184]:
grouped = food_scores['score'].groupby(food_scores['cuisine_description'])

In [185]:
grouped

In [189]:
grouped.groupby(levels = 'cty', axis = 1).count()

AttributeError: Cannot access callable attribute 'groupby' of 'SeriesGroupBy' objects, try using the 'apply' method

In [33]:
grouped_1 = food_scores['score'].groupby(food_scores['boro'])

In [34]:
grouped_1

In [35]:
grouped_1.mean()

boro
Bronx            12.947368
Brooklyn         13.334677
Manhattan        12.222222
Queens           13.037975
Staten Island    13.272727
Name: score, dtype: float64

In [36]:
grouped_2 = food_scores['grade'].groupby(food_scores['boro'])

In [39]:
grouped_2.count()

boro
Bronx             95
Brooklyn         248
Manhattan        387
Queens           237
Staten Island     33
Name: grade, dtype: int64

In [57]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [59]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [60]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.366445
     two  -0.872354
b    one  -1.088381
     two   0.593086

In [68]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [69]:
s_grouped

In [70]:
s_grouped.mean()

key1  key2
a     one     0.366445
      two    -0.872354
b     one    -1.088381
      two     0.593086
Name: data2, dtype: float64

In [72]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns =['a','b','c','d','e'],
                     index=['Joe','Steve','Wes','Jim','Travis'])

In [77]:
people.iloc[2:3,[1,2]] = np.nan #Add a few NA values

In [78]:
people

               a         b         c         d         e
Joe    -1.940461 -2.242930 -0.825758  1.350763  1.256549
Steve  -0.297506 -1.281898  1.692454  0.485797  0.578073
Wes          NaN       NaN       NaN       NaN       NaN
Jim    -0.461516  0.128839 -0.866902  0.414720  1.777255
Travis -0.663087  0.976951  0.923391 -0.298983  0.405196

In [79]:
mapping = {'a':'red','b':'red','c':'blue',
          'd':'blue','e':'red','f':'orange'}

In [80]:
by_column = people.groupby(mapping, axis = 1)

In [84]:
by_column.sum()

            blue       red
Joe     0.525004 -2.926842
Steve   2.178251 -1.001331
Wes     0.000000  0.000000
Jim    -0.452181  1.444578
Travis  0.624408  0.719060

In [85]:
map_series = pd.Series(mapping)

In [86]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [87]:
people.groupby(map_series, axis = 1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        0    0
Jim        2    3
Travis     2    3

In [88]:
people.groupby(len).sum()

          a         b         c         d         e
3 -2.401977 -2.114091 -1.692660  1.765483  3.033804
5 -0.297506 -1.281898  1.692454  0.485797  0.578073
6 -0.663087  0.976951  0.923391 -0.298983  0.405196

In [89]:
key_list = ['one','one','one','two','two']

In [91]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.940461 -2.242930 -0.825758  1.350763  1.256549
  two -0.461516  0.128839 -0.866902  0.414720  1.777255
5 one -0.297506 -1.281898  1.692454  0.485797  0.578073
6 two -0.663087  0.976951  0.923391 -0.298983  0.405196

In [97]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                                    [1,3,5,1,3]],
                                    names =['cty','tenor'])

In [98]:
hier_df = pd.DataFrame(np.random.randn(4,5), columns = columns)

In [99]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.780871  0.728125 -0.942030  0.306965 -1.379606
1      0.843416  0.019008  0.695499  0.698535 -1.913675
2     -1.344821  0.120226 -0.516039 -0.602148  0.643902
3     -0.468218 -0.206547  0.181524 -0.738165  0.819438

In [100]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [101]:
df

  key1 key2     data1     data2
0    a  one  1.861143 -0.228867
1    a  two -0.925666 -0.872354
2    b  one  0.757849 -1.088381
3    b  two  1.238252  0.593086
4    a  one -0.986684  0.961758

In [102]:
grouped = df.groupby('key1')

In [103]:
grouped['data1'].quantile(0.9)

key1
a    1.303781
b    1.190212
Name: data1, dtype: float64

In [105]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [107]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.847826  1.834112
b     0.480403  1.681467

In [108]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.017069  1.626865 -0.986684 -0.956175 -0.925666  0.467738
b      2.0  0.998051  0.339697  0.757849  0.877950  0.998051  1.118151

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.861143   3.0 -0.046488  0.930558 -0.872354 -0.550611 -0.228867
b     1.238252   2.0 -0.247648  1.188977 -1.088381 -0.668014 -0.247648


           75%       max
key1
a     0.366445  0.961758
b     0.172719  0.593086

In [109]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                     'data2': np.random.randn(1000)})

In [110]:
quartiles = pd.cut(frame.data1, 4)

In [111]:
quartiles[:10]

0    (-1.746, -0.0363]
1    (-1.746, -0.0363]
2    (-1.746, -0.0363]
3     (-0.0363, 1.673]
4    (-1.746, -0.0363]
5     (-0.0363, 1.673]
6     (-3.462, -1.746]
7     (-0.0363, 1.673]
8     (-0.0363, 1.673]
9     (-0.0363, 1.673]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.462, -1.746] < (-1.746, -0.0363] < (-0.0363, 1.673] < (1.673, 3.383]]

In [112]:
def get_stats(group):
    return {'min':group.min(), 'max':group.max(),
           'count':group.count(),'mean':group.mean()}

In [113]:
grouped = frame.data2.groupby(quartiles)

In [114]:
grouped.apply(get_stats).unstack()

                   count       max      mean       min
data1
(-3.462, -1.746]    37.0  2.642172 -0.041771 -2.340566
(-1.746, -0.0363]  471.0  3.014036  0.001814 -2.571920
(-0.0363, 1.673]   448.0  2.820335  0.020876 -2.713819
(1.673, 3.383]      44.0  2.486340  0.484098 -1.546360

In [118]:
get_stats

In [119]:
grouping = pd.cut(frame.data1, 10, labels=False)

In [120]:
grouped = frame.data2.groupby(grouping)

In [121]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0        5.0  2.642172  0.203289 -2.340566
1       17.0  1.395597 -0.134284 -1.503968
2       57.0  2.243340 -0.115612 -2.054405
3      169.0  2.758012 -0.007137 -2.370196
4      260.0  3.014036  0.032197 -2.571920
5      256.0  2.820335  0.049422 -2.713819
6      149.0  2.072236 -0.042991 -2.244487
7       67.0  2.486340  0.215770 -2.331141
8       15.0  2.348378  0.525468 -1.546360
9        5.0  1.291900  0.413542 -0.410835

In [133]:
s = pd.Series(np.random.randn(6))

In [134]:
s[::2] = np.nan

In [135]:
s

0         NaN
1   -0.373505
2         NaN
3    0.185505
4         NaN
5    0.727521
dtype: float64

In [136]:
s.fillna(s.mean())

0    0.179840
1   -0.373505
2    0.179840
3    0.185505
4    0.179840
5    0.727521
dtype: float64

In [137]:
states = ['Ohio','New York','Vermont','Florida',
         'Oregon','Nevada','California','Idaho']

In [138]:
group_key = ['East']*4 + ['West']*4

In [143]:
data = pd.Series(np.random.randn(8), index = states)

In [144]:
data

Ohio         -1.078225
New York     -0.799087
Vermont      -0.151782
Florida      -2.157608
Oregon        0.539880
Nevada        0.789004
California    0.568669
Idaho        -1.974348
dtype: float64

In [145]:
data[['Vermont','Nevada','Idaho']] = np.nan

In [146]:
data

Ohio         -1.078225
New York     -0.799087
Vermont            NaN
Florida      -2.157608
Oregon        0.539880
Nevada             NaN
California    0.568669
Idaho              NaN
dtype: float64

In [147]:
data.groupby(group_key).mean()

East   -1.344973
West    0.554274
dtype: float64

In [148]:
fill_mean = lambda g: g.fillna(g.mean())

In [149]:
data.groupby(group_key).apply(fill_mean)

Ohio         -1.078225
New York     -0.799087
Vermont      -1.344973
Florida      -2.157608
Oregon        0.539880
Nevada        0.554274
California    0.568669
Idaho         0.554274
dtype: float64

In [151]:
suits = ['H','S','C','D']
card_val = (list(range(1,11)) + [10] *3) *4
base_names = ['A'] + list(range(2,11)) + ['J','K','Q']
cards = []
for suit in ['H','S','C','D']:
    cards.extend(str(num) + suit for num in base_names)

In [152]:
deck = pd.Series(card_val, index=cards)

In [153]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [154]:
len(deck)

52

In [155]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [164]:
def draw(deck, n=5):
    return deck.sample(n)

In [165]:
draw(deck)

9H    9
8C    8
4C    4
3H    3
7S    7
dtype: int64

In [166]:
get_suit = lambda card: card[-1] #last letter is suit

In [167]:
deck.groupby(get_suit).apply(draw, n=2)

C  5C     5
   AC     1
D  3D     3
   QD    10
H  QH    10
   3H     3
S  8S     8
   3S     3
dtype: int64

In [168]:
deck.groupby(get_suit,group_keys = False).apply(draw,n=2)

9C     9
3C     3
KD    10
5D     5
2H     2
KH    10
JS    10
QS    10
dtype: int64

In [169]:
df = pd.DataFrame({'category':['a','a','a','a',
                              'b','b','b','b'],
                  'data': np.random.randn(8),
                  'weights': np.random.randn(8)})

In [170]:
df

  category      data   weights
0        a -0.155652  0.525496
1        a  0.255668 -0.850279
2        a -0.215137  0.684704
3        a -0.606930 -0.748303
4        b  0.301507 -0.919184
5        b -0.652645 -0.825688
6        b -1.062177  0.447136
7        b  0.019921 -0.849824

In [171]:
grouped = df.groupby('category')

In [172]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [174]:
grouped.apply(get_wavg)

category
a   -0.019770
b    0.107157
dtype: float64

In [175]:
data

Ohio         -1.078225
New York     -0.799087
Vermont            NaN
Florida      -2.157608
Oregon        0.539880
Nevada             NaN
California    0.568669
Idaho              NaN
dtype: float64